# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [2]:
s1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='l'))
s2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))
s3 = pd.Series(np.random.randint(10000, high=30001, size=100, dtype='l'))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [3]:
all_data=pd.concat([s1,s2,s3],axis=1)
all_data

    0  1      2
0   2  1  22295
1   3  3  12551
2   4  1  13629
3   4  1  18801
4   1  1  24798
.. .. ..    ...
95  4  1  15365
96  2  1  23804
97  4  3  16998
98  1  2  28855
99  1  2  26913

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [4]:
all_data=all_data.rename(columns={'0': 'bedrs','1': 'bathrs','2': 'price_sqr_meter'})
all_data

    0  1      2
0   2  1  22295
1   3  3  12551
2   4  1  13629
3   4  1  18801
4   1  1  24798
.. .. ..    ...
95  4  1  15365
96  2  1  23804
97  4  3  16998
98  1  2  28855
99  1  2  26913

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [5]:
# join concat the values
bigcolumn = pd.concat([s1, s2, s3], axis=0)

# it is still a Series, so we need to transform it to a DataFrame
bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))

bigcolumn

<class 'pandas.core.frame.DataFrame'>

        0
0       2
1       3
2       4
3       4
4       1
..    ...
95  15365
96  23804
97  16998
98  28855
99  26913

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [6]:
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [8]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        2
1        3
2        4
3        4
4        1
..     ...
295  15365
296  23804
297  16998
298  28855
299  26913

[300 rows x 1 columns]